---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteToSheet
source: html/43c874dc-33dc-63a0-946d-409d24e943de.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteToSheet Property

Elements copied to Sheets can only be copied from other Sheets.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteToSheet { get; }
```